 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x83a: file p1final.c, line 18.
(gdb) r
Starting program: /home/runner/IA2-Test1-Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1final.c:18
18  {
(gdb) n
20    input(&base,&height);
(gdb) s
input (base=0x7ffcd992115c, height=0x7ffcd9921160) at p1final.c:4
4     printf("Enter the value of base=\n");
(gdb) n
Enter the value of base=
5     scanf("%f",base);
(gdb) n
1
6     printf("Enter the value of height=\n");
(gdb) p *base
$2 = 1
(gdb) n
Enter the value of height=
7     scanf("%f",height);
(gdb) n
2
8   }
(gdb) p *height
$3 = 2
(gdb) n
main () at p1final.c:21
21    find_area(base,height,&area);
(gdb) s
find_area (base=1, height=2, area=0x7ffcd9921164) at p1final.c:11
11    *area=0.5*(base*height);
(gdb) n
12  }
(gdb) p *area
$5 = 1
(gdb) n
main () at p1final.c:22
22    output(base,height,area);
(gdb) s
output (base=1, height=2, area=1) at p1final.c:15
15    printf("The area of the triangle with Base:%f and Hieght:%f is %f",base,height,area);
(gdb) n
16  }
(gdb) n
main () at p1final.c:23
23    return 0;
(gdb) n
24  }
(gdb) c
Continuing.
The area of the triangle with Base:1.000000 and Hieght:2.000000 is 1.000000[Inferior 1 (process 113) exited normally]
(gdb) q